Repository: vcatafesta/chili
Catalog: temp.po
Languages: he

source: Bem vindo ao
he: ל אבה ךורב

source: O disco de destino é menor que o disco de origem
he: רוקמה קסידמ רתוי ןטק דעיה קסיד

source: Continue de qualquer maneira?
he: ?תאז לכב ךשמה

source: Clonagem concluída!
he: !םלשוה טובישה

source: É necessário desmontar a partição antes de reparticioná-la
he: שדחמ התקולח ינפל הציחמה תניעט תא לטבל ךילע

source: ** AVISO **
he: ** העדוה **

source: ERRO
he: האָיגִשְׁ

source: Info disco
he: קסיד לע עדימ

source: Ok
he: רדסב

source: DISCO DE DESTINO
he: DESTINATION DISK

source: Escolha o disco de ORIGEM
he: SOURCE קסיד רחב

source: Escolha o disco de DESTINO
he: DESTINATION קסיד תא רחב

source: Sim
he: ןכ

source: Não
he: אל

source: Use as teclas
he: תוחתפמב שמתשה

source: PARA CIMA
he: הלָעמַלְ

source: e
he: הז

source: PARA BAIXO
he: הטמ

source: para navegar
he: טוונל

source: Use
he: שמתשהל

source: para alternar entre os botões
he: םירותפכ ןיב רובעל ידכ

source: para selecionar
he: רוחבל

source: Disco ORIGEM e DESTINO não podem ser o mesmo
he: םיהז תויהל םילוכי אל DESTINATION-ו SOURCE קסיד

source: Formatando partição
he: הציחמ בוציע

source: Executando clonagem de disco
he: םיקסיד טוביש עצבמ

source: Selecionar
he: רחב

source: Sair
he: תאצל

source: Voltar
he: רוזחל

source: DISCO DE ORIGEM
he: רוקמ קסיד

source: AVISO!
he: !העדוה

source: Todos os dados disco de DESTINO abaixo serão perdidos!
he: !ודבאי הטמל DESTINATION לש קסידה ינותנ לכ

source: Continuar com a clonagem
he: טובישב ךשמה

source: Escolha o idioma:
he: :הפש רחב

source: Português
he: תיזגוטרופ

source: Inglês
he: תילגנא

source: Alemão
he: תיָנִמָרגֶ

source: Francês
he: תיתִפָרְצָ
