>>SOURCE FORMAT FREE
IDENTIFICATION DIVISION.
PROGRAM-ID. cfbstad.
ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT IN-FILE ASSIGN TO "cfbstadium.txt"
    ORGANIZATION IS LINE SEQUENTIAL.  
DATA DIVISION.
FILE SECTION.
FD IN-FILE.
01  IN-RECORD.
    05 SCHOOL-CONF  PIC X(8).
    05 SCHOOL-NAME  PIC X(17).
    05 SCHOOL-STAD  PIC X(40).
    05 SCHOOL-SEATS PIC 9(06).

WORKING-STORAGE SECTION.
01 SWITCHES.
    05 EOF-SWITCH PIC X VALUE "N".
01 COUNTERS.
    05 REC-COUNTER PIC 9(3) VALUE 0.


PROCEDURE DIVISION.
       
000-MAIN.
    PERFORM 100-INITIALIZE.
    PERFORM 200-PROCESS-RECORDS UNTIL EOF-SWITCH = "Y".
    PERFORM 300-TERMINATE.

100-INITIALIZE.
    OPEN INPUT IN-FILE.
    
200-PROCESS-RECORDS.
    DISPLAY "CONFERENCE  >>>> " SCHOOL-CONF.
    DISPLAY "SCHOOL      >>>> " SCHOOL-NAME.
    DISPLAY "STADIUM     >>>> " SCHOOL-STAD.
    DISPLAY "SEAT CAP    >>>> " SCHOOL-SEATS.
    DISPLAY " "
    READ IN-FILE
        AT END
            MOVE "Y" TO EOF-SWITCH
        NOT AT END
            ADD 1 TO REC-COUNTER
    END-READ.                    
            
300-TERMINATE.
    DISPLAY "NUM OF RECS >>>> " REC-COUNTER.
    CLOSE IN-FILE.
