IDENTIFICATION DIVISION.
PROGRAM-ID. ColorExample.
ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
SOURCE-COMPUTER. RM-COBOL.
OBJECT-COMPUTER. RM-COBOL.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 COLOR-RED        PIC X(30) VALUE "This is red text.".
01 COLOR-GREEN      PIC X(30) VALUE "This is green text.".
01 COLOR-YELLOW     PIC X(30) VALUE "This is yellow text.".

PROCEDURE DIVISION.
    CALL 'initscr' USING BY REFERENCE 0.

    CALL 'attron' USING BY VALUE COLOR_PAIR(1).
    DISPLAY COLOR-RED.
    CALL 'attroff' USING BY VALUE COLOR_PAIR(1).

    CALL 'attron' USING BY VALUE COLOR_PAIR(2).
    DISPLAY COLOR-GREEN.
    CALL 'attroff' USING BY VALUE COLOR_PAIR(2).

    CALL 'attron' USING BY VALUE COLOR_PAIR(3).
    DISPLAY COLOR-YELLOW.
    CALL 'attroff' USING BY VALUE COLOR_PAIR(3).

    CALL 'endwin'.

    STOP RUN.
