IDENTIFICATION DIVISION.
PROGRAM-ID. ColorExample.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 ESCAPE-CODE      PIC X(4) VALUE X'1B5B'.

PROCEDURE DIVISION.
    DISPLAY ESCAPE-CODE "31mThis is red text." ESCAPE-CODE "0m".
    DISPLAY ESCAPE-CODE "32mThis is green text." ESCAPE-CODE "0m".
    DISPLAY ESCAPE-CODE "33mThis is yellow text." ESCAPE-CODE "0m".

    STOP RUN.
