IDENTIFICATION DIVISION.
PROGRAM-ID. DATA.
DATA DIVISION.
FILE SECTION.

WORKING-STORAGE SECTION.
77 WS-MES		PIC9(02) VALUE ZEROS.
77 WS-NM-MES	PIC(15) VALUE SPACES.

PROCEDURE DIVISION.
P0001-INICIAL.
	MOVE ZEROS 	TO WS-MES.
	MOVE SPACES	TO WS-NM-MES.

	DISPLAY ''

P0001-FINAL.

P0002-PROCESSA.
	EVALUATE WS-MES
		WHEN 01
			MOVE 'JANEIRO' TO WS-NM-MES.
		WHEN 02
			MOVE 'FEVEREIRO' TO WS-NM-MES.
		WHEN 03
			MOVE 'MARÇO' TO WS-NM-MES.
		WHEN 04
			MOVE 'ABRIL' TO WS-NM-MES.
		WHEN 05
			MOVE 'MAIO' TO WS-NM-MES.
		WHEN 06
			MOVE 'JUNHO' TO WS-NM-MES.
		WHEN 07
			MOVE 'JULHO' TO WS-NM-MES.
		WHEN 08
			MOVE 'AGOSTO' TO WS-NM-MES.
		WHEN 09
			MOVE 'SETEMBRO' TO WS-NM-MES.
		WHEN 10
			MOVE 'OUTUBRO' TO WS-NM-MES.
		WHEN 11
			MOVE 'NOVEMBRO' TO WS-NM-MES.
		WHEN 12
			MOVE 'DEZEMBRO' TO WS-NM-MES.
	END-EVALUATE.

P0003-MOSTRA.
P0003-FINAL.

