      * hello.cbl

       IDENTIFICATION DIVISION.
      *----------------------------------------------------------------
       PROGRAM-ID.
           Hello.

       ENVIRONMENT DIVISION.
       DATA DIVISION.
      *----------------------------------------------------------------
       PROCEDURE DIVISION.
           DISPLAY 'Copyright (c) Microsoft Sistema de Informatica LTDA'.
           DISPLAY 'Hello world'.
           STOP 'PAUSA'.
           STOP RUN.
