      *> cobc -w -q -x -j -frelax-syntax -O helo01.cob
      *> hello.cob, GnuCOBOL FAQ tutorial
      *>
       identification division.
       program-id. hello.

       procedure division.
       display "Hello, world"
       goback.

       end program hello.
