      *> minimal program in cobol.  
       identification division.
       program-id. minimal.
       procedure division.
            display 'hello.cob, Copyright (c) 2023 Vilmar Catafesta'
                ' <vcatafesta@gmail.com>'
            display 'Hello World!'.
            stop run.
