       >>SOURCE FORMAT FREE
IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGCOB04.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
           SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77 WRK-NOME           PIC X(20) VALUE SPACES.
       77 WRK-SALARIO        PIC 9(06)V99 VALUE ZEROS.
       77 WRK-SALARIO-ED     PIC $ZZZ.ZZ9,99 VALUE ZEROS.
	   77 WRK-CPF            PIC X(11) VALUE ZEROS.
       77 WRK-CPF-ED         PIC ZZZ.ZZZ.ZZZ/ZZ.

       PROCEDURE DIVISION.
       	  DISPLAY 'NOME    : ' WITH NO ADVANCING
       	  ACCEPT WRK-NOME

       	  DISPLAY 'SALARIO : ' WITH NO ADVANCING
          ACCEPT WRK-SALARIO

          DISPLAY 'CPF     : ' WITH NO ADVANCING.
          ACCEPT WRK-CPF

          MOVE WRK-SALARIO TO WRK-SALARIO-ED.
          MOVE WRK-CPF TO WRK-CPF-ED.

          DISPLAY 'NOME    : ' WRK-NOME
          DISPLAY 'SALARIO : ' WRK-SALARIO-ED.
          DISPLAY 'CPF     : ' WRK-CPF-ED.
       STOP RUN.
