	   IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGCOB04.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
           SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77 WRK-NOME           PIC X(20) VALUE SPACES.
       77 WRK-SALARIO        PIC 9(06)V99 VALUE ZEROS.
       77 WRK-SALARIO-ED     PIC $ZZZ.ZZ9,99 VALUE ZEROS.
	   77 WRK-CPF     PIC X(11) VALUE ZEROS.
       77 WRK-CPF-ED  PIC ZZZ.ZZZ.ZZ9/99.

       PROCEDURE DIVISION.
       	  DISPLAY 'NOME:' ACCEPT WRK-NOME.
       	  DISPLAY 'SALARIO:'
          ACCEPT WRK-SALARIO FROM CONSOLE.

          DISPLAY 'NOME: ' WRK-NOME.
          MOVE WRK-SALARIO TO WRK-SALARIO-ED.
          DISPLAY 'SALARIO: ' WRK-SALARIO-ED.

          DISPLAY 'CPF: ' WRK-NOME.
          ACCEPT WRK-CPF.
          MOVE WRK-CPF TO WRK-CPF-ED.
          DISPLAY 'CPF: ' WRK-CPF-ED.


          STOP RUN.
