       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROG01.
      ******************************
      * AREA DE COMENTÁRIOS - REMARKS.
      * AUTHOR = GABRIEL BONINI  GBR.
      * DATA   = 29/11/2020.
      ******************************
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       PROCEDURE DIVISION.
           DISPLAY 'HELLO WORLD'.
           STOP RUN.
